## Pandas 학습

### 데이터 통합 한번 더

#### merge
- 데이터를 합칠 때 컬럼을 옆으로 늘려서 합침
- DataBase의 JOIN과 동일한 기능

In [3]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
   ---------------------------------------- 0.0/250.0 kB ? eta -:--:--
   ---------------------------------------- 0.0/250.0 kB ? eta -:--:--
   ---- ---------------------------------- 30.7/250.0 kB 435.7 kB/s eta 0:00:01
   ------------------- -------------------- 122.9/250.0 kB 1.4 MB/s eta 0:00:01
   ---------------------------------------- 250.0/250.0 kB 2.2 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

In [4]:
import pandas as pd

In [5]:
# header 엑셀에서 필요없는 제목줄 등 없애기
# skipfooter 아래쪽에 필요없는 행들을 삭제
df_left = pd.read_excel('../day01/data/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C')
df_left

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [6]:
df_right = pd.read_excel('../day01/data/sample_codemaster.xlsx')
df_right

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [24]:
## 병합
df_total = pd.merge(left=df_left, right=df_right,
                    how='left', left_on='국적코드', right_on='국적코드')

In [8]:
# NaN : 난 국적코드가 뭔지 몰라
df_total

  국적코드  성별    입국객수  국적명
0  A01  남성  106320   일본
1  A01  여성  191436   일본
2  A31  남성     319  NaN
3  A31  여성      42  NaN
4  A18  남성  158912   중국
5  A18  여성  232943   중국

In [9]:
## DB INNER JOIN과 동일
df_total = pd.merge(left=df_left, right=df_right,
                    how='left', left_on='국적코드', right_on='국적코드')

In [10]:
# 일치하지 않는 값을 생략(삭제)
df_total

  국적코드  성별    입국객수  국적명
0  A01  남성  106320   일본
1  A01  여성  191436   일본
2  A31  남성     319  NaN
3  A31  여성      42  NaN
4  A18  남성  158912   중국
5  A18  여성  232943   중국

#### append
- 데이터를 합칠 때 데이터 수가 늘도록 합치는 방법
- DB에 UNION이라는 기능과 완전 동일

In [12]:
## append를 하기 위한 데이터 하나 더 생성
df_left2 = pd. read_excel('./data/sample_2.xlsx', header=1, skipfooter=2, usecols='A:D')
df_left2

  국적코드  성별    입국객수    전년동기
0  A01  남성   92556   75992
1  A01  여성  163737  115397
2  A18  남성  155540  129908
3  A18  여성  249023  191236

In [13]:
pd.__version__

'2.2.1'

In [15]:
## df_all = df_total + df_total2
## 중요! pandas 2버전 이상에서는 append()함수가 없어짐
## pd.concat()으로 변경
df_all = df_left.append(df_left2)
df_all
# 오류인 것을 확인

AttributeError: 'DataFrame' object has no attribute 'append'

In [19]:
## 이렇게 합치면 X
pd.concat([df_left, df_left2])

  국적코드  성별    입국객수      전년동기
0  A01  남성  106320       NaN
1  A01  여성  191436       NaN
2  A31  남성     319       NaN
3  A31  여성      42       NaN
4  A18  남성  158912       NaN
5  A18  여성  232943       NaN
0  A01  남성   92556   75992.0
1  A01  여성  163737  115397.0
2  A18  남성  155540  129908.0
3  A18  여성  249023  191236.0

In [20]:
pd.concat([df_total, df_left2])

  국적코드  성별    입국객수  국적명      전년동기
0  A01  남성  106320   일본       NaN
1  A01  여성  191436   일본       NaN
2  A31  남성     319  NaN       NaN
3  A31  여성      42  NaN       NaN
4  A18  남성  158912   중국       NaN
5  A18  여성  232943   중국       NaN
0  A01  남성   92556  NaN   75992.0
1  A01  여성  163737  NaN  115397.0
2  A18  남성  155540  NaN  129908.0
3  A18  여성  249023  NaN  191236.0

In [22]:
## df_left2를 가지고 df_total2를 만듦. 국적명을 제대로 받기 위해서
df_total2 = pd.merge(left=df_left2, right=df_right,
                     how='left', left_on='국적코드', right_on='국적코드')
df_total2

  국적코드  성별    입국객수    전년동기 국적명
0  A01  남성   92556   75992  일본
1  A01  여성  163737  115397  일본
2  A18  남성  155540  129908  중국
3  A18  여성  249023  191236  중국

In [27]:
# ifnore_index는 DF의 자체 인덱스를 무시하고 새로 인덱스 생성
df_all = pd.concat([df_total, df_total2], ignore_index=True)

In [29]:
df_all

  국적코드  성별    입국객수  국적명      전년동기
0  A01  남성  106320   일본       NaN
1  A01  여성  191436   일본       NaN
2  A31  남성     319  NaN       NaN
3  A31  여성      42  NaN       NaN
4  A18  남성  158912   중국       NaN
5  A18  여성  232943   중국       NaN
6  A01  남성   92556   일본   75992.0
7  A01  여성  163737   일본  115397.0
8  A18  남성  155540   중국  129908.0
9  A18  여성  249023   중국  191236.0

In [32]:
## DF 저장 pd.to_...
## index = False DF가 만드는 임의의 인덱스는 저장안됨
df_all.to_excel('./data/df_all.xlsx', index = False)    # 파일 생성

In [34]:
## 기준연월 확인
df_total['기준연월'] = '2019-11'
df_total

  국적코드  성별    입국객수  국적명     기준연월
0  A01  남성  106320   일본  2019-11
1  A01  여성  191436   일본  2019-11
2  A31  남성     319  NaN  2019-11
3  A31  여성      42  NaN  2019-11
4  A18  남성  158912   중국  2019-11
5  A18  여성  232943   중국  2019-11

In [36]:
df_total2['기준연월'] = '2019-12'
df_total2

  국적코드  성별    입국객수    전년동기 국적명     기준연월
0  A01  남성   92556   75992  일본  2019-12
1  A01  여성  163737  115397  일본  2019-12
2  A18  남성  155540  129908  중국  2019-12
3  A18  여성  249023  191236  중국  2019-12

In [38]:
df_all = pd.concat([df_total, df_total2], ignore_index=True)
df_all

  국적코드  성별    입국객수  국적명     기준연월      전년동기
0  A01  남성  106320   일본  2019-11       NaN
1  A01  여성  191436   일본  2019-11       NaN
2  A31  남성     319  NaN  2019-11       NaN
3  A31  여성      42  NaN  2019-11       NaN
4  A18  남성  158912   중국  2019-11       NaN
5  A18  여성  232943   중국  2019-11       NaN
6  A01  남성   92556   일본  2019-12   75992.0
7  A01  여성  163737   일본  2019-12  115397.0
8  A18  남성  155540   중국  2019-12  129908.0
9  A18  여성  249023   중국  2019-12  191236.0

#### Pivot 테이블
통계를 내면서 테이블을 세로로 된 DF를 가로로 바꿔주는 기능

In [39]:
df_all.pivot_table(values='입국객수', index='국적코드', columns='기준연월', aggfunc='sum')

기준연월   2019-11   2019-12
국적코드
A01   297756.0  256293.0
A18   391855.0  404563.0
A31      361.0       NaN